In [15]:
import pandas as pd

customer_df = pd.read_csv('customer.csv')
sales_df = pd.read_csv('sales.csv')
store_df = pd.read_csv('store.csv')

In [16]:
customer_df

           고객ID 성별  연령         거주지역
0     Q05910452  F  29  서울 서초구 서초4동
1     Q00509389  M  20   경기 화성시 봉담읍
2     Q59112261  M  30  서울 서초구 서초4동
3     Q38120745  F  28   인천 중구 항동7가
4     Q18530082  F  42    강원 인제군 북면
...         ... ..  ..          ...
4995  Q82564861  F  25   경북 영주시 순흥면
4996  Q41302604  F  28   대구 달서구 파호동
4997  Q82586906  M  54  경북 영주시 휴천2동
4998  Q26354165  F  31   경북 안동시 대석동
4999  Q34149506  F  51   경북 경주시 동천동

[5000 rows x 4 columns]

In [17]:
sales_df

            고객ID   거래식별ID 점포ID      거래일자  거래시간대 상품대분류명   상품중분류명  구매건수  구매금액
0      Q00027726  A000361   AA  20140403     21    면과자       라면     2   780
1      Q00027726  A000361   AA  20140403     21    면과자    쿠키케이크     1  1600
2      Q00027726  A000363   AA  20140403     21    델리카     간편간식     1  6990
3      Q00027726  A000363   AA  20140403     21   일반식품     즉석식품     1  2500
4      Q00027726  A000364   AA  20140403     21    면과자        빵     1  1000
...          ...      ...  ...       ...    ...    ...      ...   ...   ...
57193  Q99965015  A039060   CC  20140531     20    면과자    쿠키케이크     1  2480
57194  Q99965015  A039060   CC  20140531     20     청과  토마토자두메론     1  6990
57195  Q99965015  A043414   CC  20140726     20     냉장     냉장수산     1  1740
57196  Q99965015  A045718   CC  20140823     21     낙농       우유     1  3380
57197  Q99965015  A048103   CC  20140925     17    음주류       주류     1  1040

[57198 rows x 9 columns]

In [18]:
store_df

            고객ID 가맹점ID      거래일자    구매금액  적립포인트  사용포인트
0      Q91325491     D  20140703    6800     68      0
1      Q91325491     D  20140812    1000     10      0
2      Q02441390     A  20140414  196000    312      0
3      Q02441390     A  20140418  330250   1651      0
4      Q02441390     A  20140522  121500    607      0
...          ...   ...       ...     ...    ...    ...
26039  Q42233627     E  20140805    4300     43      0
26040  Q66790365     B  20140820    7750      7      0
26041  Q66790365     B  20140827    8000      8      0
26042  Q24934888     A  20140916  163000    163      0
26043  Q28108862     A  20140922   89000    189      0

[26044 rows x 6 columns]

In [19]:
print(customer_df.info())
print('<<<<<<<<<<<<<<<<<<<<<')
print(sales_df.info())
print('<<<<<<<<<<<<<<<<<<<<<')
print(store_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   고객ID    5000 non-null   object
 1   성별      5000 non-null   object
 2   연령      5000 non-null   int64
 3   거주지역    4985 non-null   object
dtypes: int64(1), object(3)
memory usage: 156.4+ KB
None
<<<<<<<<<<<<<<<<<<<<<
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57198 entries, 0 to 57197
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   고객ID    57198 non-null  object
 1   거래식별ID  57198 non-null  object
 2   점포ID    57198 non-null  object
 3   거래일자    57198 non-null  int64
 4   거래시간대   57198 non-null  int64
 5   상품대분류명  57198 non-null  object
 6   상품중분류명  57198 non-null  object
 7   구매건수    57198 non-null  int64
 8   구매금액    57198 non-null  int64
dtypes: int64(4), object(5)
memory usage: 3.9+ MB
None
<<<<<<<<<<<<<<<<<<<<<
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26044 entries, 0 to 26043
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   고객ID    26044 non-null  object
 1   가맹점ID   26044 non-null  object
 2   거래일자    26044 non-null  int64
 3   구매금액    26044 non-null  int64
 4   적립포인트   26044 non-null  int64
 5   사용포인트   26044 non-null  int64
dtypes: int64(4), object(2)
memory usage: 1.2+ MB
None

-> 결측치는 없다.